trans.addDict([
    [300, 0, "on/off"], [300, 1, "вкл/выкл"],
    [301, 0, "prog. on/off"], [301, 1, "прог. вкл/выкл"],
    [302, 0, "busy time"], [302, 1, "время работы"],
    [303, 0, "valve"], [303, 1, "клапан"],
    [304, 0, "program"], [304, 1, "программа"],
    [305, 0, "on"], [305, 1, "вкл"],
    [306, 0, "off"], [306, 1, "выкл"],
    [307, 0, "update"], [307, 1, "обновить"],
    [308, 0, "controller state"], [308, 1, "состояние контроллера"],
    [309, 0, "load"], [309, 1, "загрузить"],
    [310, 0, "unload"], [310, 1, "выгрузить"],
    [311, 0, "reset"], [311, 1, "сброс"],
        [312, 0, "manual start"], [312, 1, "ручной запуск"],
           [313, 0, "controller time: "], [313, 1, "время контроллера:"]
]);
//menu
trans.addDict([
    [401, 0, "control"], [401, 1, "управление"],
    [402, 0, "help"], [402, 1, "помощь"]
]);

//error
trans.addDict([
    [250, 0, "failed to get data from database"], [250, 1, "не удалось получить данные из базы дынных"],
    [251, 0, "failed to send command to controller"], [251, 1, "не удалось отправить команду контроллеру"],
    [252, 0, "controller is active and ready for valve control"], [252, 1, "контроллер активен и готов к выполнению команд на управление клапанами"],
    [253, 0, "controller is at standby mode and not ready for valve control"], [253, 1, "контроллер находится в режиме ожидания и не готов управлять клапанами"],
    [254, 0, "failed to get response from controller"], [254, 1, "не удалось получить ответ от контроллера"],
    [255, 0, "unknown response from controller"], [255, 1, "неизвестный ответ от контроллера"],
    [256, 0, "broken connection with one of modules"], [256, 1, "нет связи с одним из модулей"]
]);




